---
kind: method
id: M:Autodesk.Revit.DB.CurtainGrid.GetCurtainCells
source: html/382a9587-908f-6f99-c46f-c95c0572f827.htm
---
# Autodesk.Revit.DB.CurtainGrid.GetCurtainCells Method

Gets the CurtainCells owned by this curtain grid.

## Syntax (C#)
```csharp
public ICollection<CurtainCell> GetCurtainCells()
```

## Returns
The CurtainCells owned by this curtain grid.